app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Hello world"], ["body", "Wow, rails is super easy and fun"], ["created_at", "2016-05-30 17:24:29.773257"], ["updated_at", "2016-05-30 17:24:29.773257"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "Hello **world**!\r\n\r\nWhat're *you* doing?\r\n\r\n*I'm doing great!*\r\n\r\n*CoderSchool is fun!*"], ["updated_at", "2016-05-30 18:25:48.957222"], ["id", 3]]